app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def show
    @id=params[:id]
      @post=Post.find_by(id:params[:id])

INSERT INTO "posts" ("go", "created_at", "updated_at") VALUES (?, ?, ?)  [["go", "2022-04-11 16:07:09.217371"], ["created_at", "2022-04-11 16:07:09.217900"], ["updated_at", "2022-04-11 16:07:09.217900"]]
---
      def create
        @posts = Post.new(post_params)
        case params[:commit]
        when "出勤" ; @posts.go = Time.now
        when "退勤" ; @posts.leav = Time.now
      end
        if @posts.save